Revit 2027 API
StructuralAssetClass Enumeration
 Represents the type of material described by a structural asset. This enum value is returned by Autodesk::Revit::DB::StructuralAsset::StructuralAssetClass.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralAssetClass
Public Enumeration StructuralAssetClass
public enum class StructuralAssetClass
type StructuralAssetClass
Members
Member name | Value | Description
Basic | 1 |  Structural asset class is basic.
Concrete | 4 |  Structural asset class is concrete.
Gas | 7 |  Structural asset class is gas.
Generic | 2 |  Structural asset class is generic.
Liquid | 6 |  Structural asset class is liquid.
Metal | 3 |  Structural asset class is metal.
Plastic | 8 |  Structural asset class is plastic.
Undefined | 0 |  Structural asset class is undefined.
Wood | 5 |  Structural asset class is wood.
See Also
Reference
Autodesk.Revit.DB Namespace